retireUserSoup.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://guidewire.com/ws/soapheaders" xmlns:cad="http://example.com/com/hmic/pc/webservice/cad/CADServiceAPI">
   <soapenv:Header>
      <soap:locale>en_US</soap:locale>
      <soap:authentication>
         <soap:username>su</soap:username>
         <soap:password>gw</soap:password>
      </soap:authentication>
   </soapenv:Header>
   <soapenv:Body>
      <cad:createUser>
         <!--Optional:-->
         <cad:cadRequest>
            <processUserInfoRequestType>
               <UsersInfo>
                  <!--1 or more repetitions:-->
                  <UserInfo>
                     <userName>newUser123</userName>
                     <ContactInfo>
                        <!--Optional:-->
                        <companyName>?</companyName>
                        <!--Optional:-->
                        <PersonName>
                           <!--Optional:-->
                           <firstName>?</firstName>
                           <!--Optional:-->
                           <middleName>?</middleName>
                           <!--Optional:-->
                           <lastName>?</lastName>
                        </PersonName>
                        <!--Optional:-->
                        <AddressInfo>
                           <!--Optional:-->
                           <addressLine1>?</addressLine1>
                           <!--Optional:-->
                           <addressLine2>?</addressLine2>
                           <!--Optional:-->
                           <addressLine3>?</addressLine3>
                           <!--Optional:-->
                           <city>?</city>
                           <!--Optional:-->
                           <stateCode>?</stateCode>
                           <!--Optional:-->
                           <zipCode>?</zipCode>
                           <!--Optional:-->
                           <county>?</county>
                           <!--Optional:-->
                           <country>?</country>
                           <!--Optional:-->
                           <isAddressStandardized>false</isAddressStandardized>
                        </AddressInfo>
                        <!--Optional:-->
                        <PhoneInfo>
                           <phoneTypeCode>Work</phoneTypeCode>
                           <PhoneNumber>
                              <areaCode>?</areaCode>
                              <prefix>?</prefix>
                              <suffix>?</suffix>
                           </PhoneNumber>
                        </PhoneInfo>
                        <!--Optional:-->
                        <fax>?</fax>
                        <!--Optional:-->
                        <primaryEmail>?</primaryEmail>
                     </ContactInfo>
                     <!--Optional:-->
                     <active>Yes</active>
                     <agencyNumber>0001634</agencyNumber>
                     <userRole>Agency Producer</userRole>
                     <!--Zero or more repetitions:-->
                     <agencyNumbers>?</agencyNumbers>
                     <!--Zero or more repetitions:-->
                     <prodCodesPublicID>?</prodCodesPublicID>
                  </UserInfo>
               </UsersInfo>
            </processUserInfoRequestType>
         </cad:cadRequest>
      </cad:createUser>
   </soapenv:Body>
</soapenv:Envelope>